Dlubal.TimberPro.DeformationRelativeTo
The geometry to which we consider the deformation

Dlubal.TimberPro.DeformationRelativeTo.DeformationRelativeToUnknown
Unknown geometry to which are deformations relative

Dlubal.TimberPro.DeformationRelativeTo.DeformationRelativeToUndeformedSystem
Deformations are relative to undeformed beam

Dlubal.TimberPro.DeformationRelativeTo.DeformationRelativeToShiftedEnds
Deformations are relative to shifted ends